# CanInsertColumn Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..CanInsertColumn Method
TableSectionData Class See Also
---
Verifies if a new column can be inserted at the given index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanInsertColumn(
	int nIndex
)
```

Visual Basic
---
```text
Public Function CanInsertColumn ( _
	nIndex As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanInsertColumn(
	int nIndex
)
```

# ### Parameters
nIndex
    Type: System..::..Int32 An integer index.
# ### Return Value
True if the column can be inserted, false otherwise.
# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace